# Даны пять чисел 
# Напишите программу, которая вычисляет сумму их модулей 

# Формат входных данных
# На вход программе подается пять действительных чисел aкаждое на отдельной строке.

# Формат выходных данных
# Программа должна вывести одно число – сумму модулей введённых чисел.



a = float(input())
b= float(input())
c = float(input())
d = float(input())
e = float(input())
print( abs(a) + abs(b) + abs(c) + abs(d) +  abs(e) )
