# Две старушки идут навстречу друг другу с постоянными скоростями 
# Определите, через какое время старушки встретятся, если расстояние между ними равно S км.



# Формат входных данных
# На вход программе подаются три числа с плавающей точкой , каждое на отдельной строке.

# Формат выходных данных 
# Программа должна вывести одно число в соответствии с условием задачи.

# Примечание. Это очень быстрые старушки.

s, v1, v2 = float(input()), float(input()), float(input())
print(s /( v1 + v2) )
