# x---2x---3x---4x---5x

# Формат входных данных
# На вход программе подаётся целое положительное число.

# Формат выходных данных
# Программа должна вывести текст согласно условию задачи.

a = int(input())
print(a, 2 * a, 3 * a, 4 * a, 5 * a, sep=('---'))
